tutorials/lagrangian/reactingParcelFoam/verticalChannel/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# create mesh
runApplication blockMesh

restore0Dir

# initialise with potentialFoam solution
runApplication potentialFoam

\rm -f 0/phi

# run the solver
runApplication $(getApplication)

#------------------------------------------------------------------------------
